### Forest: Lotus Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-mainnet.data.digitalocean_project.forest_project: Reading...
module.lotus-mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=72df6b97-5088-11ee-a7e3-0a58ac14d34a]
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/14512061520513425405]
module.lotus-mainnet.digitalocean_droplet.forest: Refreshing state... [id=374174913]
module.lotus-mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=b8bc585b-0481-4f81-b083-0c60c8435cc0]
module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=374174913-72df6b97-5088-11ee-a7e3-0a58ac14d34a-20230911095041403700000001]
module.lotus-mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-09-11T09:49:06Z" -> (known after apply)
      ~ disk                 = 320 -> (known after apply)
      ~ id                   = "374174913" -> (known after apply)
      ~ ipv4_address         = "46.101.197.118" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "lotus-mainnet"
      ~ price_hourly         = 0.14286 -> (known after apply)
      ~ price_monthly        = 96 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "9d:f6:f8:05:f7:c2:72:a2:b7:ce:f8:3e:71:12:2e:09",
          - "cb:ca:60:61:a9:ba:e0:a0:ba:95:35:2d:48:f3:c2:05",
          + "88:95:97:77:a1:1f:bf:e8:3a:84:20:7d:a9:4c:74:6d",
          + "e4:0e:85:24:75:5e:f3:b1:77:c4:7d:a2:3a:1e:00:b1",
            # (18 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:374174913" -> (known after apply)
      ~ vcpus                = 8 -> (known after apply)
      ~ volume_ids           = [
          - "72df6b97-5088-11ee-a7e3-0a58ac14d34a",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lotus-mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 374174913,
        ] -> (known after apply)
        id              = "b8bc585b-0481-4f81-b083-0c60c8435cc0"
        name            = "lotus-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.lotus-mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:374174913",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 374174913 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "374174913-72df6b97-5088-11ee-a7e3-0a58ac14d34a-20230911095041403700000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>